:PROPERTIES:
:header-args: :results none
:END:
#+TITLE: Litterate Configuration

**** Past logs
#+begin_src elisp :results drawer replace
(defvar bpa-org-agenda-block--past-4-days
  '(agenda ""
           ((org-agenda-overriding-header "Past few days")
            (org-agenda-span 4)
            (org-agenda-start-on-weekday nil)
            (org-agenda-start-day "-4d")
            (org-agenda-skip-scheduled-if-done 't)
            (org-agenda-show-log 't)
            (org-agenda-log-mode-items '(clock done state))))
  "A block showing what I did in the last 4 days.")
#+end_src

#+RESULTS:
:results:
bpa-org-agenda-block--past-4-days
:end:

